FKDD_COPY_DIFF_3_2026-02-13/Documents/DN_АктСверкиКредитСтрах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>DN_АктСверкиКредитСтрах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.DN_АВ_КредитноСтраховыеСделки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделенияКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоледнейЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма_АВ_КВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итого_АВ_КВ_ПО_Акту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоРасхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_СУдержанием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеЛисты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проверено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаРабочийЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РабочийЛистКредитногоОтдела</v8:Type>
								<v8:Type>cfg:DocumentRef.РабочийЛистОтделаСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыРабочегоЛиста</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЛиста</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочегоЛиста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Программа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КредитныеПрограммы</v8:Type>
								<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьАвтомобиля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВЗаКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВПроцентКАСКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВСуммаКАСКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВПроцентСЖБанк</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВСуммаСЖБанк</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВПроцентGAPБанк</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВСуммаGAPБанк</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВПроцентПрУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСуммаКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВСуммаПрУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСуммаАВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВПоАкту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МенеджерОформитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_ВидыОплатыСтраховки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БланкКСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТТ_БланкиКСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхождениеПоОплатам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/DN_АктСверкиКредитСтрах/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ Отказ тогда
		Если ЭтоНовый() тогда
			АвторДокумента = ПараметрыСеанса.Пользователь.Сотрудник; 			
		КонецЕсли;
		АвторПоледнейЗаписи = ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;
	//БизТех Аляль 04.06.2024г. ТЗ 282 <<
	Если РабочиеЛисты.Найти(Ложь, "Удержание") = Неопределено и ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой Тогда
		БТ_СУдержанием = Истина;
	Иначе
		БТ_СУдержанием = Ложь;
	КонецЕсли; 
	//БизТех Аляль >>
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ (ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу
		или ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу) тогда

		Если НЕ Отказ тогда
			
			Движение = РегистрыСведений.DN_АВ_КредитноСтраховыеСделки;
		    Записи = Движение.СоздатьНаборЗаписей();
			
			Для Каждого Строка из РабочиеЛисты Цикл
				Если Строка.Проверено тогда
					Отказ = ПроверимМодифицированностьЛиста(Строка);
					
					Если Отказ тогда
						Прервать;
					КонецЕсли;
					
					Записи.Отбор.Регистратор.Установить(Строка.СсылкаНаРабочийЛист);
					Записи.Прочитать();
					Если Записи.Количество() тогда
						Для Каждого СтрокаЗаписи из Записи цикл
							Если ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой
									и ЗначениеЗаполнено(СтрокаЗаписи.АктСверки) 
										и Строка.Проверено и Строка.Расхождение < 0 тогда
								СтрокаЗаписи.УчтеноДопКВ = Истина;			
							ИначеЕсли Не ЗначениеЗаполнено(СтрокаЗаписи.АктСверки) 
									и СовпадениеПоАкту(СтрокаЗаписи) и Строка.Проверено 
										и (ХозОперация = Справочники.ХозОперации.АктСверкиКредитный 
											или ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой)   тогда
								СтрокаЗаписи.АктСверки = Ссылка;
								СтрокаЗаписи.АВАкта = Строка.АВПоАкту;
								СтрокаЗаписи.Расхождение = Строка.Расхождение; 
								СтрокаЗаписи.УчтеноДопКВ = Ложь;			
							КонецЕсли;
						КонецЦикла;
						Записи.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СовпадениеПоАкту(Строка)

	Если Строка.Организация = Организация 
		//и Строка.ПодразделенияКомпании = ПодразделенияКомпании
			и Строка.Контрагент = Контрагент
				и Строка.ДоговорыВзаиморасчетов = ДоговорВзаиморасчетов тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции // СовпадениеПоАкту()

Функция ПроверимМодифицированностьЛиста(СтрокаАкта)

	РабочийЛист = СтрокаАкта.СсылкаНаРабочийЛист;
	
	Если ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
		
		Если НЕ СтрокаАкта.Статус = РабочийЛист.Статус тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ СтрокаАкта.ОбщаяСуммаАВ = РабочийЛист.ОбщаяСуммаАВ тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ Организация = РабочийЛист.Организация тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		//Если НЕ ПодразделенияКомпании = РабочийЛист.ПодразделениеКомпании тогда
		Если НЕ СтрокаАкта.Подразделение = РабочийЛист.ПодразделениеКомпании тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ Контрагент = РабочийЛист.КредитнаяПрограмма.БанкКонтрагент тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ ДоговорВзаиморасчетов = РабочийЛист.КредитнаяПрограмма.DN_ДоговорВзаиморсчетов тогда
			Сообщить("Кредитный лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
		
		Если НЕ СтрокаАкта.Статус = РабочийЛист.Статус тогда
			Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ Организация = РабочийЛист.Организация тогда
			Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		//Если НЕ ПодразделенияКомпании = РабочийЛист.ПодразделениеКомпании тогда 
		Если НЕ СтрокаАкта.Подразделение = РабочийЛист.ПодразделениеКомпании тогда
			Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;
		
		Отбор = Новый Структура("ОбъектСтрахования,ПрограммаСтрахования,СуммаКомиссии,БланкПолиса",
			СтрокаАкта.Автомобиль,СтрокаАкта.Программа,СтрокаАкта.ОбщаяСуммаАВ,СтрокаАкта.БланкКСО);
		СтрокаРабочегоЛиста = РабочийЛист.ВариантыСтрахования.НайтиСтроки(Отбор);
		
		Если СтрокаРабочегоЛиста.Количество() тогда
			СтрокаРабочегоЛиста = СтрокаРабочегоЛиста[0];
			
			Если НЕ СтрокаАкта.ОбщаяСуммаАВ = СтрокаРабочегоЛиста.СуммаКомиссии тогда
				Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
				Возврат Истина;
			КонецЕсли;
			
			Если НЕ Контрагент = СтрокаРабочегоЛиста.Страховщик тогда
				Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
				Возврат Истина;
			КонецЕсли;
			
			Если НЕ ДоговорВзаиморасчетов = СтрокаРабочегоЛиста.ПрограммаСтрахования.Договор тогда
				Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе.
							|Не совпадает договор в Акте с договором в Программе страхования рабочего листа!");
				Возврат Истина;
			КонецЕсли;
		Иначе
			Сообщить("Страховой лист " + РабочийЛист.Номер + " от " + РабочийЛист.Дата + " был модифицирован, необходимо перезаполнить табличную часть в данном документе");
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;

	
	Возврат Ложь;
КонецФункции // ПроверимМодифицированностьЛиста()

Функция НайтиДокументы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеализацияТоваров.Ссылка КАК Ссылка,
		|	ЗаявкаНаРасходДС.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров,
		|	Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|ГДЕ
		|	РеализацияТоваров.ДокументОснование = &ДокументОснование
		|	И ЗаявкаНаРасходДС.ДокументОснование = &ДокументОснование
		|	И РеализацияТоваров.Проведен = ИСТИНА
		|	И ЗаявкаНаРасходДС.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // НайтиДокументы()

Процедура ПриКопировании(ОбъектКопирования)
	РабочиеЛисты.Очистить();
	ИтогоРасхождение = 0;
	Итого_АВ_КВ_ПО_Акту = 0;
	ОбщаяСумма_АВ_КВ = 0;
	ДатаАкта = "010101";
	НомерАкта = "";
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ (ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу
		или ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу) тогда
		Если НайтиДокументы() тогда
			Отказ = Истина;
			Сообщить("На основании данного документа, есть проведенные документы. Сначала распроведите их");
		КонецЕсли;
		
		Движение = РегистрыСведений.DN_АВ_КредитноСтраховыеСделки;
	    Записи = Движение.СоздатьНаборЗаписей();
		
		Для Каждого Строка из РабочиеЛисты Цикл
			Записи.Отбор.Регистратор.Установить(Строка.СсылкаНаРабочийЛист);
			Записи.Прочитать();
			Если Записи.Количество() тогда
				Для Каждого СтрокаЗаписи из Записи цикл
					Если ЗначениеЗаполнено(СтрокаЗаписи.АктСверки) 
							и (ХозОперация = Справочники.ХозОперации.АктСверкиКредитный 
								или ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой)   тогда
						Если НЕ СтрокаЗаписи.УчтеноДопКВ тогда
							СтрокаЗаписи.АктСверки = Документы.DN_АктСверкиКредитСтрах.ПустаяСсылка();
							СтрокаЗаписи.АВАкта = 0;
							СтрокаЗаписи.Расхождение = 0;   
						Иначе
							Отказ = Истина;
							Сообщить("Существуют Акты Сверки Доп КВ по этому документу, сначала распроведите эти Акты");
						КонецЕсли;
					ИначеЕсли ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой тогда
						СтрокаЗаписи.УчтеноДопКВ = Ложь;
					КонецЕсли;				
				КонецЦикла;
				Записи.Записать();
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;	
КонецПроцедуры
